core/src/test/resources/wsdl/with_examples/order_api_examples/create_product.json

{
  "http-request": {
    "method": "POST",
    "path": "/",
    "headers": {
      "SOAPAction": "\"/orders/createProduct\"",
      "Content-Type": "text/xml"
    },
    "body": "<S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\"><S:Body><ns0:CreateProduct xmlns:ns0=\"http://www.example.com/orders\"><name>Phone</name><type>Gadget</type><inventory>123</inventory></ns0:CreateProduct></S:Body></S:Envelope>"
  },
  "http-response": {
    "status": 200,
    "headers": {
      "Content-Type": "text/xml"
    },
    "body": "<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\"><SOAP-ENV:Body><Id><id>123</id></Id></SOAP-ENV:Body></SOAP-ENV:Envelope>"
  }
}
